*** example, install


#

umask 022

/usr/local/texlive/2015/bin/x86_64-linux/tlmgr info fontspec.sty




sudo /usr/local/texlive/2014/bin/x86_64-linux/tlmgr install pgf

sudo /usr/local/texlive/2014/bin/x86_64-linux/tlmgr install ms


By default TeX Live will install in /usr/local/texlive


    the system cache goes in /var/lib/texmf;
    the user cache goes in ~/.texliveYYYY.


 texmf-dist/tex/latex/pgf/frontendlayer/tikz.sty


Q: What's up with all these dirs /usr/share/{texmf,texmf-dist,texmf-var,texmf-config}?

A: TeX uses several "source trees"; they have the same internal structure, and can "overlap". This is to allow users to modify files provided system-wide without having to access files they're not supposed to access. Here's the portion of the main config file which lists all these dirs with some explanations ($SELFAUTODIR=/usr/share):


https://wiki.archlinux.org/index.php/TeX_Live_FAQ


|              |
| texmf-dist   |
|--------------+------------------------------------+---|
|              |
| gentoo tlmgr | /usr/local/texlive/2014/texmf-dist |   |
|              |
| arch         | /usr/share
|              |

texhash

mktexlsr



Checking package status

The universal way to check if a file is available to TeX compilers is the command-line tool kpsewhich.

$ kpsewhich tikz
/usr/local/texlive/2012/texmf-dist/tex/plain/pgf/frontendlayer/tikz.tex

http://en.wikibooks.org/wiki/LaTeX/Installing_Extra_Packages


tlmgr info <package>


| general | gentoo specific |
|---------+-----------------|
| texhash | mktexlsr        |
|         |                 |
|         | TEXMF           |
|         | TEXMFHOME       |
|         | TEXMFLOCAL      |
|         |                 |

kpsewhich --var-value TEXMF
{/home/c5766/.texlive/texmf-config,/home/c5766/.texlive/texmf-var,/home/c5766/texmf,!!//etc/texmf,!!//var/lib/texmf,!!/usr/share/texmf,!!/usr/share/../local/share/texmf,!!/usr/share/texmf-site,!!/usr/share/texmf-dist}

kpsewhich --var-value TEXMFHOME

/home/c5766/texmf


kpsewhich --var-value TEXMFLOCAL
/usr/share/../local/share/texmf



kpsewhich --var-value TEXMFVAR

kpsewhich --var-value TEXMFDIST




tlmgr examples

tlmgr show collections

tlmgr show collection-latex

tlmgr info 

tlmgr info collections

tlmgr info collection-latex 

tlmgr info collection-latex --list


tlmgr search package




#+HEADERS: :re
#+BEGIN_SRC sh

tlmgr info biblatex

#+END_SRC

#+RESULTS:
tlmgr: package repository http://shadow.ind.ntou.edu.tw/ctan/systems/texlive/tlnet
package:     biblatex
category:    Package
shortdesc:   Bibliographies in LaTeX using BibTeX for sorting only.
longdesc:    Biblatex is a complete reimplementation of the bibliographic facilities provided by LaTeX in conjunction with BibTeX. It redesigns the way in which LaTeX interacts with BibTeX at a fairly fundamental level. With biblatex, BibTeX is only used (if it is used at all) to sort the bibliography and to generate labels. Formatting of the bibliography is entirely controlled by TeX macros (the BibTeX-based mechanism embeds some parts of formatting in the BibTeX style file. Good working knowledge in LaTeX should be sufficient to design new bibliography and citation styles; nothing related to BibTeX's language is needed. In fact, users need not remain bound to BibTeX for use with biblatex: an alternative bibliography processor biblatex- biber is available. Development of biblatex and biblatex-biber is closely coupled; the present release of biblatex is designed to work with biblatex-biber version 0.9.6. The package needs e- TeX, and uses the author's etoolbox and logreq packages. For users of biblatex-biber, version 0.9 is required (at least; refer to the notes for the version of biblatex-biber that you are using). Apart from the features unique to biblatex, the package also incorporates core features of the following packages: babelbib, bibtopic, bibunits, chapterbib, cite, inlinebib, mcite and mciteplus, mlbib, multibib, splitbib. Biblatex supports split bibliographies and multiple bibliographies within one document, and separate lists of bibliographic shorthands. Bibliographies may be subdivided into parts (by chapter, by section, etc.) and/or segmented by topics (by type, by keyword, etc.). Biblatex is fully localized and can interface with the babel.
installed:   Yes
revision:    34433
sizes:       doc: 18425k, run: 2097k
relocatable: No
cat-version: 2.9a
cat-date:    2014-06-24 19:29:18 +0200
cat-license: lppl
collection:  collection-bibtexextra

tlmgr: package repository http://shadow.ind.ntou.edu.tw/ctan/systems/texlive/tlnet
package:     biblatex
category:    Package
shortdesc:   Bibliographies in LaTeX using BibTeX for sorting only.
longdesc:    Biblatex is a complete reimplementation of the bibliographic facilities provided by LaTeX in conjunction with BibTeX. It redesigns the way in which LaTeX interacts with BibTeX at a fairly fundamental level. With biblatex, BibTeX is only used (if it is used at all) to sort the bibliography and to generate labels. Formatting of the bibliography is entirely controlled by TeX macros (the BibTeX-based mechanism embeds some parts of formatting in the BibTeX style file. Good working knowledge in LaTeX should be sufficient to design new bibliography and citation styles; nothing related to BibTeX's language is needed. In fact, users need not remain bound to BibTeX for use with biblatex: an alternative bibliography processor biblatex- biber is available. Development of biblatex and biblatex-biber is closely coupled; the present release of biblatex is designed to work with biblatex-biber version 0.9.6. The package needs e- TeX, and uses the author's etoolbox and logreq packages. For users of biblatex-biber, version 0.9 is required (at least; refer to the notes for the version of biblatex-biber that you are using). Apart from the features unique to biblatex, the package also incorporates core features of the following packages: babelbib, bibtopic, bibunits, chapterbib, cite, inlinebib, mcite and mciteplus, mlbib, multibib, splitbib. Biblatex supports split bibliographies and multiple bibliographies within one document, and separate lists of bibliographic shorthands. Bibliographies may be subdivided into parts (by chapter, by section, etc.) and/or segmented by topics (by type, by keyword, etc.). Biblatex is fully localized and can interface with the babel.
installed:   No
sizes:       doc: 18425k, run: 2097k
relocatable: Yes
cat-version: 2.9a
cat-date:    2014-06-24 19:29:18 +0200
cat-license: lppl
collection:  collection-bibtexextra


** tlmgr install package


| check package status | tlmgr info fontspec
|                      |
| install the package  |
|                      | su
|                      | umask 022
|                      | /usr/local/texlive/2014/bin/x86_64-linux/tlmgr install fontspec |
|                      |

/usr/local/texlive/2015/bin/x86_64-linux/tlmgr

#+HEADERS: :re
#+BEGIN_SRC sh

tlmgr info luatexja

#+END_SRC

#+RESULTS:
tlmgr: package repository http://shadow.ind.ntou.edu.tw/ctan/systems/texlive/tlnet
package:     luatexja
category:    Package
shortdesc:   Typeset Japanese with lua(la)tex.
longdesc:    The package offers support for typesetting Japanese documents with LuaTeX. Either of the Plain and LaTeX2e formats may be used with the package.
installed:   No
sizes:       src: 405k, doc: 3181k, run: 1093k
relocatable: Yes
cat-version: 20141013.0
cat-date:    2014-10-13 09:09:46 +0200
cat-license: other-free
collection:  collection-langjapanese

tlmgr: package repository http://shadow.ind.ntou.edu.tw/ctan/systems/texlive/tlnet

#+HEADERS: :re
#+HEADERS: :re
#+HEADERS: :dir /sudo::/home/c5766/tmpfs
#+BEGIN_SRC sh

umask 022

/usr/local/texlive/2014/bin/x86_64-linux/tlmgr install fontspec


#+END_SRC

#+HEADERS: :re
#+HEADERS: :re
#+HEADERS: :dir /sudo::/home/c5766/tmpfs
#+BEGIN_SRC sh

umask 022

/usr/local/texlive/2014/bin/x86_64-linux/tlmgr install luatexja


#+END_SRC

#+HEADERS: :re
#+HEADERS: :re
#+HEADERS: :dir /sudo::/home/c5766/tmpfs
#+BEGIN_SRC sh

umask 022

/usr/local/texlive/2014/bin/x86_64-linux/tlmgr install luaotfload

#+END_SRC

#+HEADERS: :re
#+HEADERS: :re
#+HEADERS: :dir /sudo::/home/c5766/tmpfs
#+BEGIN_SRC sh

umask 022

/usr/local/texlive/2014/bin/x86_64-linux/tlmgr install luatexbase

#+END_SRC

#+HEADERS: :re
#+HEADERS: :re
#+HEADERS: :dir /sudo::/home/c5766/tmpfs
#+BEGIN_SRC sh

umask 022

/usr/local/texlive/2014/bin/x86_64-linux/tlmgr install lualibs

#+END_SRC


#+HEADERS: :re
#+HEADERS: :re
#+HEADERS: :dir /sudo::/home/c5766/tmpfs
#+BEGIN_SRC sh

umask 022

/usr/local/texlive/2014/bin/x86_64-linux/tlmgr install adobemapping

#+END_SRC

#+HEADERS: :re
#+HEADERS: :re
#+HEADERS: :dir /sudo::/home/c5766/tmpfs
#+BEGIN_SRC sh

umask 022

/usr/local/texlive/2014/bin/x86_64-linux/tlmgr install euenc

#+END_SRC


#+HEADERS: :re
#+HEADERS: :re
#+HEADERS: :dir /sudo::/home/c5766/tmpfs
#+BEGIN_SRC sh

umask 022

/usr/local/texlive/2014/bin/x86_64-linux/tlmgr install xunicode

#+END_SRC


#+HEADERS: :re
#+HEADERS: :re
#+HEADERS: :dir /sudo::/home/c5766/tmpfs
#+BEGIN_SRC sh

umask 022

/usr/local/texlive/2014/bin/x86_64-linux/tlmgr install lcdftypetools

#+END_SRC

#+HEADERS: :re
#+HEADERS: :dir /sudo::/home/c5766/tmpfs
#+BEGIN_SRC sh

umask 022

/usr/local/texlive/2014/bin/x86_64-linux/tlmgr install biblatex

#+END_SRC

#+HEADERS: :re
#+HEADERS: :re
#+HEADERS: :dir /sudo::/home/c5766/tmpfs
#+BEGIN_SRC sh

umask 022

/usr/local/texlive/2014/bin/x86_64-linux/tlmgr install etoolbox

#+END_SRC

#+HEADERS: :re
#+HEADERS: :re
#+HEADERS: :dir /sudo::/home/c5766/tmpfs
#+BEGIN_SRC sh

umask 022

/usr/local/texlive/2014/bin/x86_64-linux/tlmgr install graphics

#+END_SRC

#+HEADERS: :re
#+HEADERS: :re
#+HEADERS: :dir /sudo::/home/c5766/tmpfs
#+BEGIN_SRC sh

umask 022

/usr/local/texlive/2014/bin/x86_64-linux/tlmgr install logreq

#+END_SRC

#+HEADERS: :re
#+HEADERS: :re
#+HEADERS: :dir /sudo::/home/c5766/tmpfs
#+BEGIN_SRC sh

umask 022

/usr/local/texlive/2014/bin/x86_64-linux/tlmgr install url

#+END_SRC

#+HEADERS: :re
#+HEADERS: :re
#+HEADERS: :dir /sudo::/home/c5766/tmpfs
#+BEGIN_SRC sh

umask 022

/usr/local/texlive/2014/bin/x86_64-linux/tlmgr install biber

#+END_SRC


